{
    "title": "Willkommen in der Lernumgebung",
    "pages": {
        "about": {
            "title": "Impressum",
            "text": "Diese Lernumgebung wurde im Zusammenhang mit dem Buch 'einfach Informatik 3/4' erstellt.\n Feedback ist sehr erwünscht: dnaepfer@student.ethz.ch",
            "author": "Autor: Dario Naepfer",
            "version": "Version 2.0 -- Updates: Neues Gesamt-Design, fixiertes Buttonmenü, Tutorial-Layout überarbeitet.\n Version 2.1 -- Neu: Schwierigkeitsstufen für Ladungen überprüfen.\n Version 2.2 -- Texte in JSON File, Sprachenwechsel möglich"
        },
        "notFound": {
            "title": "Seite nicht gefunden! Error 404",
            "text": "Diese Seite ist zur Zeit nicht verfügbar.\n Feedback hinterlassen: dnaepfer@student.ethz.ch"
        }
    },
    "game": {
        "buttons": {
            "back": "Zur Hauptseite",
            "next": "Nächste Aufgabe",
            "restart": "Neu starten",
            "check": "Überprüfen",
            "help": "Anleitung"
        },
        "verifier": {
            "true": "Das ist richtig!",
            "false": "Das ist leider nicht richtig!"
        },
        "tutorial": "Anleitung zum Spiel"
    },
    "tasks": {
        "checkWeights": {
            "title": "Gewichte überprüfen",
            "intro": " wollte diese Gewichte verteilen:",
            "description": "Überprüfe, ob alle Gewichte korrekt verteilt wurden. Pass auf, dass kein Boot zu schwer beladen wird. Jedes Boot darf maximal so viele Kilogramm aufladen, wie auf seinem Segel geschrieben steht. Beantworte dann die untenstehenden Fragen, indem du auf Richtig oder Falsch klickst. Viel Erfolg!",
            "statements": {
                "s1": "Jedes Gewicht ist verwendet worden.",
                "s2": "Kein Gewicht ist mehrmals verwendet worden.",
                "s3": "Kein Boot ist zu schwer beladen."
            },
            "true": "Richtig",
            "false": "Falsch"
        },
        "distributeWeights": {
            "title": "Gewichte verteilen",
            "intro": "Verteile alle Gewichte auf die drei Boote so, dass kein Boot zu schwer beladen ist.",
            "description": "Verteile die Gewichte auf die Boote: Klicke auf ein Gewicht und ziehe es an den gewünschten Platz. Klicke auf ein Gewicht, um es wieder aus dem Boot zu entfernen. Jedes Gewicht soll genau einmal verwendet werden. Pass auf, dass kein Boot zu schwer beladen wird. Jedes Boot darf höchstens so viele Kilogramm aufladen, wie auf seinem Segel geschrieben steht. Viel Erfolg!"
        },
        "addWeights":  {
            "title": "Gewichte ergänzen",
            "intro": "Verteile alle übrigen Gewichte auf die drei Boote so, dass kein Boot zu schwer beladen ist.",
            "description": "Verteile die übrigen Gewichte auf die Boote: Klicke auf ein Gewicht und ziehe es an den gewünschten Platz. Klicke auf ein Gewicht, um es wieder aus dem Boot zu entfernen. Jedes Gewicht soll genau einmal verwendet werden. Pass auf, dass kein Boot zu schwer beladen wird. Jedes Boot darf maximal so viele Kilogramm aufladen, wie auf seinem Segel geschrieben steht. Viel Erfolg!"
        },
        "optimizeWeights":  {
            "title":  "Boote maximal beladen",
            "intro": "Verteile alle Gewichte auf möglichst wenig Boote.\n Tipp: Berechne zuerst die Summe aller Gewichte.",
            "description": "Verteile alle Gewichte () auf so wenig Boote wie möglich: Klicke auf ein Gewicht und ziehe es an den gewünschten Platz. Klicke auf ein Gewicht, um es wieder aus dem Boot zu entfernen. Jedes Gewicht soll genau einmal verwendet werden. Wenn es mehrere Lösungen gibt, wähle die Boote mit weniger Gewicht auf dem Segel. Viel Erfolg!"
        },
        "distributeTowers": "Türme bauen",
        "addTowers": "Türme ergänzen",
        "optimizeTowers": "Türme optimal verteilen"
    }
}