{
    "info": "WICHTIG: Alle Einträge dieser JSON-Datei müssen in diesem Format vorhanden sein, damit eine vollständige Funktionalität garantiert werden kann.",
    "title": "einfach Informatik 3/4",
    "pages": {
        "home": {
            "title": "Willkommen in der Lernumgebung",
            "introduction": "Hier findest Du viele Rätsel zu bekannten Informatik-Problemen. Klicke Dich durch die verschiedenen Aufgaben und meistere die Herausforderungen. Viel Spass!",
            "bottom": "Zur Aufgaben-Auswahl ↓",
            "top": "Nach oben ↑"
        },
        "about": {
            "title": "Impressum",
            "descrption": "Diese Lernumgebung wurde im Zusammenhang mit dem Buch 'einfach Informatik 3/4' erstellt. Feedback ist sehr erwünscht: dnaepfer@student.ethz.ch",
            "author": "Autor: Dario Naepfer",
            "oldVersion": "Version 2.6 -- Neu: Überarbeitete Navigationsbar und erweiterte Graphenklasse mit verschiedenen Algos",
            "version": "Version 2.7 -- Neu: Das erste Spiel der Türme-Serie ist fertig!"
        },
        "notFound": {
            "title": "Seite nicht gefunden! Error 404",
            "text": "Diese Seite ist zur Zeit nicht verfügbar. Feedback hinterlassen: dnaepfer@student.ethz.ch"
        }
    },
    "game": {
        "buttons": {
            "back": "Zur Hauptseite",
            "next": "Nächste Aufgabe",
            "restart": "Neu starten",
            "check": "Überprüfen",
            "help": "Anleitung"
        },
        "verifier": {
            "true": "Das ist richtig!",
            "false": "Das ist leider nicht richtig!"
        },
        "tutorial": "Anleitung zum Spiel", 
        "warning": {
            "title": "Achtung!",
            "info": "Diese Seite ist nicht für Smartphones optimiert. Versuche es mit einem anderen Gerät",
            "play": "Trotzdem spielen →"
        }
    },
    "tasks": {
        "checkWeights": {
            "id": 1,
            "path": "/check-weights",
            "img": "/transport/wood.png",
            "title": "Gewichte überprüfen",
            "intro": " wollte diese Gewichte verteilen:",
            "description": "Überprüfe, ob alle Gewichte korrekt verteilt wurden. Pass auf, dass kein Boot zu schwer beladen wird. Jedes Boot darf maximal so viele Kilogramm aufladen, wie auf seinem Segel geschrieben steht. Beantworte dann die untenstehenden Fragen, indem du auf 'Richtig' oder 'Falsch' klickst. Viel Erfolg!",
            "statements": {
                "s1": "Jedes Gewicht ist verwendet worden.",
                "s2": "Kein Gewicht ist mehrmals verwendet worden.",
                "s3": "Kein Boot ist zu schwer beladen.",
                "true": "Richtig",
                "false": "Falsch"
            },
            "tips": {
                "tip1": "Beantworte alle Fragen, bevor du auf Überprüfen klickst!",
                "tip2": "Tipp: Zähle die Gewichte für jedes einzelne Boot zusammen!",
                "tip3": "Tipp: Ist jedes Gewicht genau einmal verwendet worden?",
                "tip4": "Tipp: Überprüfe für jedes einzelne Gewicht, wo es platziert ist!"
            }
        },
        "distributeWeights": {
            "id": 2,
            "path": "/distribute-weights",
            "img": "/transport/wood.png",
            "title": "Gewichte verteilen",
            "intro": "Verteile alle Gewichte auf die drei Boote so, dass kein Boot zu schwer beladen ist.",
            "description": "Verteile die Gewichte auf die Boote: Klicke auf ein Gewicht und ziehe es an den gewünschten Platz. Klicke auf ein Gewicht, um es wieder aus dem Boot zu entfernen. Jedes Gewicht soll genau einmal verwendet werden. Pass auf, dass kein Boot zu schwer beladen wird. Jedes Boot darf höchstens so viele Kilogramm aufladen, wie auf seinem Segel geschrieben steht. Viel Erfolg!"
        },
        "addWeights":  {
            "id": 3,
            "path": "/add-weights",
            "img": "/transport/wood.png",
            "title": "Gewichte ergänzen",
            "intro": "Verteile alle übrigen Gewichte auf die drei Boote so, dass kein Boot zu schwer beladen ist.",
            "description": "Verteile alle Gewichte, die noch nicht verteilt worden sind, auf die Boote: Klicke auf ein Gewicht und ziehe es an den gewünschten Platz. Klicke auf ein Gewicht, um es wieder aus dem Boot zu entfernen. Jedes Gewicht soll genau einmal verwendet werden. Pass auf, dass kein Boot zu schwer beladen wird. Jedes Boot darf maximal so viele Kilogramm aufladen, wie auf seinem Segel geschrieben steht. Viel Erfolg!"
        },
        "optimizeWeights":  {
            "id": 4,
            "path": "/optimize-weights",
            "img": "/transport/wood.png",
            "title":  "Gewichte optimal verteilen",
            "intro": "Verteile alle Gewichte auf möglichst wenig Boote. | Tipp: Berechne zuerst die Summe aller Gewichte.",
            "description": "Verteile alle Gewichte auf so wenig Boote wie möglich: Klicke auf ein Gewicht und ziehe es an den gewünschten Platz. Klicke auf ein Gewicht, um es wieder aus dem Boot zu entfernen. Jedes Gewicht soll genau einmal verwendet werden. Wenn es mehrere Lösungen gibt, benutze die Boote mit weniger Gewicht auf dem Segel. Viel Erfolg!",
            "tips": {
                "tip1": "Tipp: Du hast noch nicht alle Gewichte verwendet!",
                "tip2": "Tipp: Pass auf, dass kein Boot zu schwer beladen ist!",
                "tip3": "Guter Versuch! Schaffst Du es, eine noch bessere Lösung zu finden?"
            }
        },
        "checkTowers":  {
            "id": 5,
            "path": "/check-towers",
            "img": "/bridges/tower.png",
            "title":  "Türme überprüfen",
            "intro": "Überprüfe, ob die Türme so gesetzt sind, dass man mit den Türmen alle Kanäle überwachen kann.",
            "description": "Überprüfe, ob die Türme so gesetzt sind, dass man mit den Türmen alle Kanäle überwachen kann. Von einem gesetzten Turm kann man alle angrenzenden Kanäle bis zur nächsten Kreuzung überwachen. Viel Erfolg!",
            "tips": {
                "tip1": "Sind wirklich alle Kanäle überwacht?"
            }
        },
        "buildTowers":  {
            "id": 6,
            "path": "/build-towers",
            "img": "/bridges/tower.png",
            "title":  "Türme bauen",
            "intro": "Setze die Türme so, dass man mit den Türmen alle Kanäle überwachen kann.",
            "description": "Setze die Türme so, dass man mit den Türmen alle Kanäle überwachen kann: Klicke auf einen Turm und ziehe ihn an den gewünschten Platz. Klicke auf einen Turm, um ihn wieder aus der Landschaft zu entfernen. Viel Erfolg!",
            "tips": {
                "tip1": "Hier in der Nähe wird ein Kanal noch nicht überwacht: Feld "
            }
        }
    }
}